<a href="https://colab.research.google.com/github/2heeng/ADP_Practical_Ex/blob/main/%EB%8D%B0%EC%9D%B4%ED%84%B0_%EB%B6%84%EC%84%9D_%ED%94%84%EB%A1%9C%EC%A0%9D%ED%8A%B8.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## 데이터 분석 프로젝트

In [ ]:
import requests

In [ ]:
url = 'https://github.com/wikibook/python-for-data-analysis-rev/raw/master/readme.txt'

In [ ]:
# URL에 해당하는 파일을 내려받음
r = requests.get(url)

In [ ]:
# 파일을 저장할 폴더와 파일명을 지정
file_name = 'C:/ex/py/myPyCode/data/readme.txt'

In [ ]:
# 내려받은 파일을 지정한 폴더에 저장
with open(file_name, 'wb') as f:
    f.write(r.content)

In [ ]:
import os

In [ ]:
!type C:\ex\py\myPyCode\data\missing_data_test.csv

연도,제품1,제품2,제품3,제품4
2015,250,150,,
2016,200,160,170,
2017,150,200,100,150
2018,120,230,130,170
2019,,250,140,

In [ ]:
import pandas as pd

In [ ]:
data_file = "C:/ex/py/myPyCode/data/missing_data_test.csv"

In [ ]:
df = pd.read_csv(data_file, encoding = "cp949")

In [ ]:
df

        제품1  제품2    제품3    제품4
연도
2015  250.0  150    NaN    NaN
2016  200.0  160  170.0    NaN
2017  150.0  200  100.0  150.0
2018  120.0  230  130.0  170.0

In [ ]:
type(df)

pandas.core.frame.DataFrame

In [ ]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [ ]:
df.iloc[0]

연도     2015.0
제품1     250.0
제품2     150.0
제품3       NaN
제품4       NaN
Name: 0, dtype: float64

In [ ]:
type(df.iloc[0])

pandas.core.series.Series

In [ ]:
#series는 index가 있는 배열

In [ ]:
df.iloc[0].index

Index(['연도', '제품1', '제품2', '제품3', '제품4'], dtype='object')

In [ ]:
df.연도

0    2015
1    2016
2    2017
3    2018
4    2019
Name: 연도, dtype: int64

In [ ]:
df['연도']

0    2015
1    2016
2    2017
3    2018
4    2019
Name: 연도, dtype: int64

In [ ]:
df

     연도    제품1  제품2    제품3    제품4
0  2015  250.0  150    NaN    NaN
1  2016  200.0  160  170.0    NaN
2  2017  150.0  200  100.0  150.0
3  2018  120.0  230  130.0  170.0
4  2019    NaN  250  140.0    NaN

In [ ]:
df.iloc[2]

연도     2017.0
제품1     150.0
제품2     200.0
제품3     100.0
제품4     150.0
Name: 2, dtype: float64

In [ ]:
df.iloc[2:4]

     연도    제품1  제품2    제품3    제품4
2  2017  150.0  200  100.0  150.0
3  2018  120.0  230  130.0  170.0

In [ ]:
df.iloc[2:4,2:4]

   제품2    제품3
2  200  100.0
3  230  130.0

In [ ]:
df.iloc[0:3,3:5]

     제품3    제품4
0    NaN    NaN
1  170.0    NaN
2  100.0  150.0

In [ ]:
df.set_index('연도')

        제품1  제품2    제품3    제품4
연도
2015  250.0  150    NaN    NaN
2016  200.0  160  170.0    NaN
2017  150.0  200  100.0  150.0
2018  120.0  230  130.0  170.0
2019    NaN  250  140.0    NaN

In [ ]:
df=df.set_index('연도')

In [ ]:
df

        제품1  제품2    제품3    제품4
연도
2015  250.0  150    NaN    NaN
2016  200.0  160  170.0    NaN
2017  150.0  200  100.0  150.0
2018  120.0  230  130.0  170.0
2019    NaN  250  140.0    NaN

In [ ]:
df.loc[2015,'제품3']

nan

In [ ]:
df.loc[[2015,2016,2017],['제품3','제품4']]

        제품3    제품4
연도
2015    NaN    NaN
2016  170.0    NaN
2017  100.0  150.0

In [ ]:
df.describe()

              제품1         제품2         제품3         제품4
count    4.000000    5.000000    4.000000    2.000000
mean   180.000000  198.000000  135.000000  160.000000
std     57.154761   43.243497   28.867513   14.142136
min    120.000000  150.000000  100.000000  150.000000
25%    142.500000  160.000000  122.500000  155.000000
50%    175.000000  200.000000  135.000000  160.000000
75%    212.500000  230.000000  147.500000  165.000000
max    250.000000  250.000000  170.000000  170.000000

In [ ]:
df.loc[2017].values

array([150., 200., 100., 150.])

In [ ]:
#2017년 평균구하기

In [ ]:
avg = (150+200+100+150)/4

In [ ]:
avg

150.0

In [ ]:
df.제품2

연도
2015    150
2016    160
2017    200
2018    230
2019    250
Name: 제품2, dtype: int64

In [ ]:
import numpy as np

In [ ]:
np.mean(df.제품2) #평균

198.0

In [ ]:
avg=np.mean(df.제품2)

In [ ]:
deviation=avg-df.제품2.values #편차(deviation)

In [ ]:
deviation

array([ 48.,  38.,  -2., -32., -52.])

In [ ]:
deviation**2

array([2304., 1444.,    4., 1024., 2704.])

In [ ]:
np.sum(deviation**2)

7480.0

In [ ]:
df.제품2.var() #분산

1870.0

In [ ]:
np.sqrt(df.제품2.var() )

43.243496620879306

In [ ]:
#분산(variation)에다가 제곱근 -> 표준편차(standard deviation)

In [ ]:
np.sum(deviation**2)/5

1496.0

In [ ]:
df

        제품1  제품2    제품3    제품4
연도
2015  250.0  150    NaN    NaN
2016  200.0  160  170.0    NaN
2017  150.0  200  100.0  150.0
2018  120.0  230  130.0  170.0
2019    NaN  250  140.0    NaN

In [ ]:
df.isnull()

        제품1    제품2    제품3    제품4
연도
2015  False  False   True   True
2016  False  False  False   True
2017  False  False  False  False
2018  False  False  False  False
2019   True  False  False   True

In [ ]:
df.isnull().sum()

제품1    1
제품2    0
제품3    1
제품4    3
dtype: int64

In [ ]:
help(df.drop)

Help on method drop in module pandas.core.frame:

drop(labels: 'IndexLabel' = None, *, axis: 'Axis' = 0, index: 'IndexLabel' = None, columns: 'IndexLabel' = None, level: 'Level' = None, inplace: 'bool' = False, errors: 'IgnoreRaise' = 'raise') -> 'DataFrame | None' method of pandas.core.frame.DataFrame instance
    Drop specified labels from rows or columns.

    Remove rows or columns by specifying label names and corresponding
    axis, or by specifying directly index or column names. When using a
    multi-index, labels on different levels can be removed by specifying
    the level. See the :ref:`user guide <advanced.shown_levels>`
    for more information about the now unused levels.

    Parameters
    ----------
    labels : single label or list-like
        Index or column labels to drop. A tuple will be used as a single
        label and not treated as a list-like.
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Whether to drop labels from the index (0 or 'index') or
        columns (1 or 'columns').
    index : single label or list-like
        Alternative to specifying axis (``labels, axis=0``
        is equivalent to ``index=labels``).
    columns : single label or list-like
        Alternative to specifying axis (``labels, axis=1``
        is equivalent to ``columns=labels``).
    level : int or level name, optional
        For MultiIndex, level from which the labels will be removed.
    inplace : bool, default False
        If False, return a copy. Otherwise, do operation
        inplace and return None.
    errors : {'ignore', 'raise'}, default 'raise'
        If 'ignore', suppress error and only existing labels are
        dropped.

    Returns
    -------
    DataFrame or None
        DataFrame without the removed index or column labels or
        None if ``inplace=True``.

    Raises
    ------
    KeyError
        If any of the labels is not found in the selected axis.

    See Also
    --------
    DataFrame.loc : Label-location based indexer for selection by label.
    DataFrame.dropna : Return DataFrame with labels on given axis omitted
        where (all or any) data are missing.
    DataFrame.drop_duplicates : Return DataFrame with duplicate rows
        removed, optionally only considering certain columns.
    Series.drop : Return Series with specified index labels removed.

    Examples
    --------
    >>> df = pd.DataFrame(np.arange(12).reshape(3, 4),
    ...                   columns=['A', 'B', 'C', 'D'])
    >>> df
       A  B   C   D
    0  0  1   2   3
    1  4  5   6   7
    2  8  9  10  11

    Drop columns

    >>> df.drop(['B', 'C'], axis=1)
       A   D
    0  0   3
    1  4   7
    2  8  11

    >>> df.drop(columns=['B', 'C'])
       A   D
    0  0   3
    1  4   7
    2  8  11

    Drop a row by index

    >>> df.drop([0, 1])
       A  B   C   D
    2  8  9  10  11

    Drop columns and/or rows of MultiIndex DataFrame

    >>> midx = pd.MultiIndex(levels=[['lama', 'cow', 'falcon'],
    ...                              ['speed', 'weight', 'length']],
    ...                      codes=[[0, 0, 0, 1, 1, 1, 2, 2, 2],
    ...                             [0, 1, 2, 0, 1, 2, 0, 1, 2]])
    >>> df = pd.DataFrame(index=midx, columns=['big', 'small'],
    ...                   data=[[45, 30], [200, 100], [1.5, 1], [30, 20],
    ...                         [250, 150], [1.5, 0.8], [320, 250],
    ...                         [1, 0.8], [0.3, 0.2]])
    >>> df
                    big     small
    lama    speed   45.0    30.0
            weight  200.0   100.0
            length  1.5     1.0
    cow     speed   30.0    20.0
            weight  250.0   150.0
            length  1.5     0.8
    falcon  speed   320.0   250.0
            weight  1.0     0.8
            length  0.3     0.2

    Drop a specific index combination from the MultiIndex
    DataFrame, i.e., drop the combination ``'falcon'`` and
    ``'weight'``, which deletes only the corresponding row

    >>> df.drop(index=('falcon', 'weight'))
                    big     small
    lama    speed   45.0    30.0
            weight  200.0   100.0
            length  1.5     1.0
    cow     speed   30.0    20.0
            weight  250.0   150.0
            length  1.5     0.8
    falcon  speed   320.0   250.0
            length  0.3     0.2

    >>> df.drop(index='cow', columns='small')
                    big
    lama    speed   45.0
            weight  200.0
            length  1.5
    falcon  speed   320.0
            weight  1.0
            length  0.3

    >>> df.drop(index='length', level=1)
                    big     small
    lama    speed   45.0    30.0
            weight  200.0   100.0
    cow     speed   30.0    20.0
            weight  250.0   150.0
    falcon  speed   320.0   250.0
            weight  1.0     0.8

In [ ]:
df=df.drop(index=[2019])

In [ ]:
df

        제품1  제품2    제품3    제품4
연도
2015  250.0  150    NaN    NaN
2016  200.0  160  170.0    NaN
2017  150.0  200  100.0  150.0
2018  120.0  230  130.0  170.0

In [ ]:
df2=df.drop(columns=['제품3','제품4'])

In [ ]:
df2

        제품1  제품2
연도
2015  250.0  150
2016  200.0  160
2017  150.0  200
2018  120.0  230

In [ ]:
df_copy=df.copy()

In [ ]:
df_copy.dropna()

        제품1  제품2    제품3    제품4
연도
2017  150.0  200  100.0  150.0
2018  120.0  230  130.0  170.0

In [ ]:
df_copy2=df.copy()

In [ ]:
df_copy2.dropna(axis=1) #0은 행을 삭제, 1은 축(세로)을 삭제

        제품1  제품2
연도
2015  250.0  150
2016  200.0  160
2017  150.0  200
2018  120.0  230

In [ ]:
df_copy3=df.copy()

In [ ]:
df_copy3

        제품1  제품2    제품3    제품4
연도
2015  250.0  150    NaN    NaN
2016  200.0  160  170.0    NaN
2017  150.0  200  100.0  150.0
2018  120.0  230  130.0  170.0

In [ ]:
df_copy3.dropna(axis=1,subset=[2015])

        제품1  제품2
연도
2015  250.0  150
2016  200.0  160
2017  150.0  200
2018  120.0  230

In [ ]:
df_copy4=df.copy()

In [ ]:
df_copy4.dropna(axis=1,subset=[2016,2018])

        제품1  제품2    제품3
연도
2015  250.0  150    NaN
2016  200.0  160  170.0
2017  150.0  200  100.0
2018  120.0  230  130.0

In [ ]:
df

        제품1  제품2    제품3    제품4
연도
2015  250.0  150    NaN    NaN
2016  200.0  160  170.0    NaN
2017  150.0  200  100.0  150.0
2018  120.0  230  130.0  170.0

In [ ]:
df_copy4

        제품1  제품2    제품3    제품4
연도
2015  250.0  150    NaN    NaN
2016  200.0  160  170.0    NaN
2017  150.0  200  100.0  150.0
2018  120.0  230  130.0  170.0

In [ ]:
df_copy4.fillna(method='ffill')

        제품1  제품2    제품3    제품4
연도
2015  250.0  150    NaN    NaN
2016  200.0  160  170.0    NaN
2017  150.0  200  100.0  150.0
2018  120.0  230  130.0  170.0

In [ ]:
values={'제품3':400}
df_copy4.fillna(value=values)

        제품1  제품2    제품3    제품4
연도
2015  250.0  150  400.0    NaN
2016  200.0  160  170.0    NaN
2017  150.0  200  100.0  150.0
2018  120.0  230  130.0  170.0

In [ ]:
df_copy4.fillna(method='bfill')

        제품1  제품2    제품3    제품4
연도
2015  250.0  150  170.0  150.0
2016  200.0  160  170.0  150.0
2017  150.0  200  100.0  150.0
2018  120.0  230  130.0  170.0

In [ ]:
df_copy4=df_copy4.reset_index() #인덱스 설정 리셋

In [ ]:
df_copy4

     연도    제품1  제품2    제품3    제품4
0  2015  250.0  150    NaN    NaN
1  2016  200.0  160  170.0    NaN
2  2017  150.0  200  100.0  150.0
3  2018  120.0  230  130.0  170.0

In [ ]:
df3= pd.read_csv(data_file, encoding = "cp949")

In [ ]:
df3

     연도    제품1  제품2    제품3    제품4
0  2015  250.0  150    NaN    NaN
1  2016  200.0  160  170.0    NaN
2  2017  150.0  200  100.0  150.0
3  2018  120.0  230  130.0  170.0
4  2019    NaN  250  140.0    NaN

## 데이터의 요약 및 재구성

### 데이터의 구조 살펴보기

In [ ]:
data_file2 = "C:/ex/py/myPyCode/data/total_sales_data.csv"

In [ ]:
df_sales = pd.read_csv(data_file2)
df_sales

  매장명  제품종류 모델명  판매  재고
0   A  스마트폰  S1   1   2
1   A  스마트폰  S2   2   5
2   A    TV  V1   3   5
3   B  스마트폰  S2   4   6
4   B  스마트폰  S1   5   8
5   B    TV  V1   6   9
6   C  스마트폰  S2   2   4
7   C    TV  V1   3   6
8   C    TV  V2   7   9

In [ ]:
df_sales.describe()

             판매        재고
count  9.000000  9.000000
mean   3.666667  6.000000
std    2.000000  2.345208
min    1.000000  2.000000
25%    2.000000  5.000000
50%    3.000000  6.000000
75%    5.000000  8.000000
max    7.000000  9.000000

In [ ]:
df_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   매장명     9 non-null      object
 1   제품종류    9 non-null      object
 2   모델명     9 non-null      object
 3   판매      9 non-null      int64
 4   재고      9 non-null      int64
dtypes: int64(2), object(3)
memory usage: 492.0+ bytes

In [ ]:
df_sales.pivot_table(index=["매장명", "제품종류", "모델명"],
                     values =["판매","재고"], aggfunc='sum')

              재고  판매
매장명 제품종류 모델명
A   TV   V1    5   3
    스마트폰 S1    2   1
         S2    5   2
B   TV   V1    9   6
    스마트폰 S1    8   5
         S2    6   4
C   TV   V1    6   3
         V2    9   7
    스마트폰 S2    4   2